Autodesk.Revit.DB.Analysis.BuildingEnvelopeAnalyzer.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Analysis.BuildingEnvelopeAnalyzerOptions)
Creates a new analyzer.
document:
The document that contains the physical model of the building.
options:
Options for the method analyzing the building elements for the building envelope.
Returns:
The created analyzer.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015